Revit 2027 API
PartUtils.IsMergedPart Method
 Is the Part the result of a merge.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsMergedPart(
	Part part
)
Public Shared Function IsMergedPart (
	part As Part
) As Boolean
public:
static bool IsMergedPart(
	Part^ part
)
static member IsMergedPart :
        part : Part -> bool
Parameters
part Part
Return Value
Boolean
 True if the Part is the result of a merge operation.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartUtils Class
Autodesk.Revit.DB Namespace